TodoList/app/controllers/api/todos_controller.rb

    def index
      render json: Todo.all
---
SELECT "todos".* FROM "todos"

    def create
      @todo = Todo.new(todo_params)
      if @todo.save
---
INSERT INTO "todos" ("body", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "sucks"], ["title", "data"], ["created_at", "2018-10-03 00:24:40.206371"], ["updated_at", "2018-10-03 00:24:40.206371"]]